app/Controllers/Api.php

SELECT *
FROM "tbl_objek"
WHERE "tbl_objek"."deleted_at" IS NULL
---
    public function index()
    {
        $dataobjek = $this->TabelObjekModel->findAll();