app/Controllers/Leafletdraw.php

INSERT INTO "tbl_data_point" ("nama", "geom") VALUES ('poin', 'POINT (109.926587 -7.739744)')
---
    public function simpan_point()
    {
        $data = [
            'nama' => $this->request->getPost('input_point_name'),
            'geom' => $this->request->getPost('input_point_geometry'),
        ];

        $this->TbldatapointModel->save($data);

UPDATE "tbl_data_polygon" SET "nama" = 'bg f gf', "deskripsi" = 'coba gan', "updated_at" = '2022-11-23 21:44:20'
WHERE "tbl_data_polygon"."id" IN ('12')
---
    public function simpan_edit_data_polygon()
    {
        $data = [
            'id' => $this->request->getPost('id_polygon'),
            'nama' => $this->request->getPost('edit_polygon_name'),
            'deskripsi' => $this->request->getPost('edit_polygon_deskripsi'),
        ];

        $this->TbldatapolygonModel->save($data);