app/Controllers/Objek.php

    public function table()
    {
        $data['objek'] = $this->TabelObjekModel->findAll();
---
SELECT *
FROM "tbl_objek"
WHERE "tbl_objek"."deleted_at" IS NULL