app/Controllers/Objek.php

    public function table()
    {
        $data['objek'] = $this->TabelObjekModel->findAll();
---
SELECT *
FROM "tbl_objek"
WHERE "tbl_objek"."deleted_at" IS NULL

    public function Edit($id)
    {
        $data['objek'] = $this->TabelObjekModel->find($id);
---
SELECT *
FROM "tbl_objek"
WHERE "tbl_objek"."deleted_at" IS NULL
AND "tbl_objek"."id" = '18'

            'foto' => $namaFoto,
        ];

        $this->TabelObjekModel->update($id, $data);
---
UPDATE "tbl_objek" SET "nama" = 'mie ayam pakde wonogiri', "deskripsi" = 'mie ayam', "longitude" = '110.44545364406079', "latitude" = '-7.801616057041328', "foto" = 'foto_mieayampakdewonogiri.jpg', "updated_at" = '2022-11-02 07:48:26'
WHERE "tbl_objek"."id" IN ('18')